using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.InteropServices;
using System.Security;
using System.Text;
using System.Threading.Tasks;

namespace Zodiacon.ManagedWindows.Core {
    [StructLayout(LayoutKind.Sequential)]
    struct GENERIC_MAPPING {
        public uint GenericRead;
        public uint GenericWrite;
        public uint GenericExecute;
        public uint GenericAll;
    }

    [StructLayout(LayoutKind.Sequential)]
    struct SYSTEM_OBJECTTYPE_INFORMATION {
        public uint NextEntryOffset;
        public uint NumberOfObjects;
        public uint NumberOfHandles;
        public uint TypeIndex;
        public uint InvalidAttributes;
        public GENERIC_MAPPING GenericMapping;
        public uint ValidAccessMask;
        public uint PoolType;
        public byte SecurityRequired;
        public byte WaitableObject;
        public UNICODE_STRING TypeName;
    }

    public enum ProcessInformationClass : uint {
        BasicInformation = 0,
        QuotaLimits = 1,
        IoCounters = 2,
        VmCounters = 3,
        Times = 4,
        BasePriority = 5,
        RaisePriority = 6,
        DebugPort = 7,
        ExceptionPort = 8,
        AccessToken = 9,
        LdtInformation = 10,
        LdtSize = 11,
        DefaultHardErrorMode = 12,
        IoPortHandlers = 13,
        PooledUsageAndLimits = 14,
        WorkingSetWatch = 15,
        UserModeIOPL = 16,
        EnableAlignmentFaultFixup = 17,

        public uint HighWaterNonPagedPoolUsage;
        public uint HighWaterNamePoolUsage;
        public uint HighWaterHandleTableUsage;
        public uint InvalidAttributes;
        public GENERIC_MAPPING GenericMapping;
        public uint ValidAccessMask;
        public byte SecurityRequired;
        public byte MaintainHandleCount;
        public uint PoolType;
        public uint DefaultPagedPoolCharge;
        public uint DefaultNonPagedPoolCharge;
    }

    [StructLayout(LayoutKind.Sequential)]
    struct OBJECT_TYPES_INFORMATION {
        public uint NumberOfTypes;
        //public OBJECT_TYPE_INFORMATION TypeInformation;
    }

    [StructLayout(LayoutKind.Sequential)]
    unsafe struct TEB64 {
        public NT_TIB Tib;
        public uint EnvironmentPointer;
        public CLIENT_ID Cid;
        public IntPtr ActiveRpcInfo;
        public IntPtr ThreadLocalStoragePointer;
        public IntPtr Peb;
        public uint LastErrorValue;
        public uint CountOfOwnedCriticalSections;
        public IntPtr CsrClientThread;
        public IntPtr Win32ThreadInfo;

        public fixed uint Win32ClientInfo[0x1f];

        public IntPtr WOW32Reserved;
        public uint CurrentLocale;
        public uint FpSoftwareStatusRegister;

        public fixed long SystemReserved1[0x36];
        IntPtr Spare1;
        public uint ExceptionCode;

        fixed uint SpareBytes1[0x28];
        fixed long SystemReserved2[0xa];

        public uint GdiRgn;
        public uint GdiPen;
        public uint GdiBrush;
        public CLIENT_ID RealClientId;
        IntPtr GdiCachedProcessHandle;
        uint GdiClientPID;
        uint GdiClientTID;
        IntPtr GdiThreadLocaleInfo;
        fixed long UserReserved[5];

        public fixed long GlDispatchTable[0x118];
        fixed uint GlReserved1[0x1a];

        long GlReserved2;
        public long GlSectionInfo;
        public long GlSection;
        public long GlTable;
        public long GlCurrentRC;
        public long GlContext;
        public int LastStatusValue;
        public UNICODE_STRING StaticUnicodeString;

        public fixed char StaticUnicodeBuffer[0x105];
        long DeallocationStack;
        fixed long TlsSlots[0x40];
        public LIST_ENTRY TlsLinks;
        public IntPtr Vdm;
        public IntPtr ReservedForNtRpc;

        fixed long DbgSsReserved[2];
        public uint HardErrorDisabled;

        public fixed long Instrumentation[0x10];
        public IntPtr WinSockData;
        public uint GdiBatchCount;
        uint Spare2;
        uint Spare3;
        uint Spare4;
        public IntPtr ReservedForOle;
        public uint WaitingOnLoaderLock;
        public IntPtr StackCommit;
        public IntPtr StackCommitMax;
        public IntPtr StackReserved;
    }

    [StructLayout(LayoutKind.Explicit)]
    struct SYSTEM_PROCESS_INFORMATION64 {
        [FieldOffset(0)] public uint NextEntryOffset;
        [FieldOffset(4)] public int NumberOfThreads;
        [FieldOffset(8)] public long WorkingSetPrivateSize;
        [FieldOffset(0x10)] public uint HardFaultCount;
        [FieldOffset(0x14)] public uint NumberOfThreadsHighWatermark;
        [FieldOffset(0x18)] public ulong CycleTime;
        [FieldOffset(0x20)] public long CreateTime;
        [FieldOffset(0x28)] public long UserTime;
        [FieldOffset(0x30)] public long KernelTime;
        [FieldOffset(0x38)] public UNICODE_STRING ImageName;
        [FieldOffset(0x48)] public int BasePriority;
        [FieldOffset(0x50)] public IntPtr UniqueProcessId;
        [FieldOffset(0x58)] public IntPtr InheritedFromUniqueProcessId;
        [FieldOffset(0x60)] public int HandleCount;
        [FieldOffset(0x64)] public int SessionId;
        [FieldOffset(0x68)] public UIntPtr UniqueProcessKey;
        [FieldOffset(0x70)] public long PeakVirtualSize;
        [FieldOffset(0x78)] public long VirtualSize;
        [FieldOffset(0x80)] public uint PageFaultCount;
        [FieldOffset(0x88)] public long PeakWorkingSetSize;
        [FieldOffset(0x90)] public long WorkingSetSize;
        [FieldOffset(0x98)] public long QuotaPeakPagedPoolUsage;
        [FieldOffset(0xa0)] public long QuotaPagedPoolUsage;
        [FieldOffset(0xa8)] public long QuotaPeakNonPagedPoolUsage;
        [FieldOffset(0xb0)] public long QuotaNonPagedPoolUsage;
        [FieldOffset(0xb8)] public long PagefileUsage;
        [FieldOffset(0xc0)] public long PeakPagefileUsage;
        [FieldOffset(0xc8)] public long PrivatePageCount;
        [FieldOffset(0xd0)] public long ReadOperationCount;
        [FieldOffset(0xd8)] public long WriteOperationCount;
        [FieldOffset(0xe0)] public long OtherOperationCount;
        [FieldOffset(0xe8)] public long ReadTransferCount;
        [FieldOffset(0xf0)] public long WriteTransferCount;
        [FieldOffset(0xf8)] public long OtherTransferCount;
    }

    [StructLayout(LayoutKind.Explicit)]
    struct SYSTEM_PROCESS_INFORMATION32 {
        [FieldOffset(0)] public uint NextEntryOffset;
        [FieldOffset(4)] public int NumberOfThreads;
        [FieldOffset(8)] public long WorkingSetPrivateSize;
        [FieldOffset(0x10)] public uint HardFaultCount;
        [FieldOffset(0x14)] public uint NumberOfThreadsHighWatermark;
        [FieldOffset(0x18)] public ulong CycleTime;
        [FieldOffset(0x20)] public long CreateTime;
        [FieldOffset(0x28)] public long UserTime;
        [FieldOffset(0x30)] public long KernelTime;
        [FieldOffset(0x38)] public UNICODE_STRING32 ImageName;
        [FieldOffset(0x40)] public int BasePriority;
        [FieldOffset(0x44)] public IntPtr UniqueProcessId;
        [FieldOffset(0x48)] public IntPtr InheritedFromUniqueProcessId;
        [FieldOffset(0x4c)] public int HandleCount;
        [FieldOffset(0x50)] public int SessionId;
        [FieldOffset(0x54)] public UIntPtr UniqueProcessKey;
        [FieldOffset(0x58)] public long PeakVirtualSize;
        [FieldOffset(0x5c)] public long VirtualSize;
        [FieldOffset(0x60)] public uint PageFaultCount;
        [FieldOffset(0x64)] public uint PeakWorkingSetSize;
        [FieldOffset(0x68)] public uint WorkingSetSize;
        [FieldOffset(0x6c)] public uint QuotaPeakPagedPoolUsage;
        [FieldOffset(0x70)] public uint QuotaPagedPoolUsage;
        [FieldOffset(0x74)] public uint QuotaPeakNonPagedPoolUsage;
        [FieldOffset(0x78)] public uint QuotaNonPagedPoolUsage;
        [FieldOffset(0x7c)] public uint PagefileUsage;
        [FieldOffset(0x80)] public uint PeakPagefileUsage;
        [FieldOffset(0x84)] public uint PrivatePageCount;
        [FieldOffset(0x88)] public long ReadOperationCount;
        [FieldOffset(0x90)] public long WriteOperationCount;
        [FieldOffset(0x98)] public long OtherOperationCount;
        [FieldOffset(0xa0)] public long ReadTransferCount;
        [FieldOffset(0xa8)] public long WriteTransferCount;
        [FieldOffset(0xb0)] public long OtherTransferCount;
    }


    public enum ThreadState {
        Initialized = 0,
        Ready = 1,
        Running = 2,
        Standby = 3,
        Terminated = 4,
        Waiting = 5,
        Transition = 6,
        DeferredReady = 7,
        GateWaitObsolete = 8,
        WaitingForProcessInSwap = 9
    }

    public enum WaitReason {
        Executive = 0,
        FreePage = 1,
        PageIn = 2,
        PoolAllocation = 3,
        DelayExecution = 4,
        Suspended = 5,
        UserRequest = 6,
        WrExecutive = 7,
        WrFreePage = 8,
        WrPageIn = 9,
        WrPoolAllocation = 10,
        WrDelayExecution = 11,
        WrSuspended = 12,
        WrUserRequest = 13,
        WrSpare0 = 14,
        WrQueue = 15,
        WrLpcReceive = 16,
        WrLpcReply = 17,
        WrVirtualMemory = 18,
        WrPageOut = 19,
        WrRendezvous = 20,
        WrKeyedEvent = 21,
        WrTerminated = 22,
        WrProcessInSwap = 23,
